# В этой задаче вам нужно написать программу, которая считывает два вещественных числа и выведет их сумму (подвохов в
# ней нет). Числа задаются по одному в строке.
#
# Напомним, что для преобразования строки в вещественное число используется функция float

a = float(input())
b = float(input())
print(a + b)
