# Дано положительное вещественное число X. Выведите его дробную часть.

x = float(input())
print(x % 1)
