# Еще одна задача без подвоха :)
#
# Вам необходимо написать программу, которая считает вещественные числа A и B и выведет результат деления A на B.
#
# Напомним, что вещественное деление делается с помощью операции / (в отличие от деления нацело, которое делается
# с помощью операции //).

a = float(input())
b = float(input())
print(a / b)
