# Выведите слово One (обязательно с большой буквы!), если было введено число 1 и не выводите ничего если было введено
# любое другое число.

x = int(input())
if x == 1:
    print("One")
