# Выведите слово One (обязательно с большой буквы!), если было введено число 1, выводите фразу Not one (также
# обязательно с большой буквы) если было введено любое другое число.

x = int(input())
if x == 1:
    print("One")
else:
    print("Not one")
