# Для решения этой задачи вам нужно написать программу, которая будет содержать в себе два последовательных print.
#
# В качестве ответа нужно сдать только вывод программы (не саму программу).
#
# В первой строке ответа выведите результат умножения числа 12321482349287421983798237241 на 123721947294287497234957.
#
# Во второй строке ответа выведите результат целочисленного деления числа 2793042981421894210947210947 на
# 209734721987420234281947.

print(12321482349287421983798237241 * 123721947294287497234957)
print(2793042981421894210947210947 // 209734721987420234281947)
